Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Somebody manually merges changes from the Weblate git repository into the upstream repository.
sv: NÃ¥gon sammanfogar manuellt Ã¤ndringar frÃ¥n Weblate git-arkivet till uppstrÃ¶msarkivet.

source: Somebody rewrites history produced by Weblate (e.g. by eliminating merge commits), merges changes, and tells Weblate to reset the content in the upstream repository.
sv: NÃ¥gon skriver om historiken som skapats av Weblate (t.ex. genom att ta bort sammanfogningskommandon), sammanfogar Ã¤ndringarna och ber Weblate att Ã¥terstÃ¤lla innehÃ¥llet i uppstrÃ¶msrepositoriet.

source: Of course you are free to mix all of these as you wish.
sv: Naturligtvis kan du blanda alla dessa efter eget tycke och smak.

source: How can I limit Weblate access to only translations, without exposing source code to it?
sv: Hur kan jag begrÃ¤nsa Ã¥tkomsten till Weblate till endast Ã¶versÃ¤ttningar, utan att exponera kÃ¤llkoden fÃ¶r den?

source: You can use `git submodule`_ for separating translations from source code while still having them under version control.
sv: Du kan anvÃ¤nda `git submodule`_ fÃ¶r att separera Ã¶versÃ¤ttningar frÃ¥n kÃ¤llkoden samtidigt som de fortfarande Ã¤r under versionskontroll.

source: Create a repository with your translation files.
sv: Skapa ett arkiv med dina Ã¶versÃ¤ttningsfiler.

source: Add this as a submodule to your code:
sv: LÃ¤gg till detta som en submodul till din kod:

source: Link Weblate to this repository, it no longer needs access to the repository containing your source code.
sv: LÃ¤nka Weblate till detta arkiv, det behÃ¶ver inte lÃ¤ngre ha Ã¥tkomst till arkivet som innehÃ¥ller din kÃ¤llkod.

source: You can update the main repository with translations from Weblate by:
sv: Du kan uppdatera huvudarkivet med Ã¶versÃ¤ttningar frÃ¥n Weblate genom att:

source: Please consult the `git submodule`_ documentation for more details.
sv: Se dokumentationen fÃ¶r `git submodule`_ fÃ¶r mer information.

source: How can I check whether my Weblate is set up properly?
sv: Hur kan jag kontrollera om min Weblate Ã¤r korrekt konfigurerad?

source: Weblate includes a set of configuration checks which you can see in the admin interface, just follow the :guilabel:`Performance report` link in the admin interface, or open the ``/manage/performance/`` URL directly.
sv: Weblate innehÃ¥ller en uppsÃ¤ttning konfigurationskontroller som du kan se i administratÃ¶rsgrÃ¤nssnittet. FÃ¶lj bara lÃ¤nken :guilabel:`Prestandarapport` i administratÃ¶rsgrÃ¤nssnittet eller Ã¶ppna URL:en ``/manage/performance/`` direkt.

source: Why are all commits committed by Weblate <noreply@weblate.org>?
sv: VarfÃ¶r Ã¤r alla commit gjorda av Weblate <noreply@weblate.org>?

source: Weblate uses ``Weblate <noreply@weblate.org>`` as the default **committer** for all commits, which is configured by :setting:`DEFAULT_COMMITER_EMAIL` and :setting:`DEFAULT_COMMITER_NAME`. This is a technical identifier showing that the commit was processed through Weblate.
sv: Weblate anvÃ¤nder ``Weblate <noreply@weblate.org>`` som standard **committer** fÃ¶r alla commits, vilket konfigureras av :setting:`DEFAULT_COMMITER_EMAIL` och :setting:`DEFAULT_COMMITER_NAME`. Detta Ã¤r en teknisk identifierare som visar att commit har bearbetats via Weblate.

source: However, the **author** of each commit is correctly recorded as the individual user who made the translation (when using Git). This means you can see who actually translated each string by examining the commit author field. The same applies to Mercurial; only Subversion does not have this capability.
sv: Dock registreras **fÃ¶rfattaren** till varje commit korrekt som den enskilda anvÃ¤ndare som gjorde Ã¶versÃ¤ttningen (vid anvÃ¤ndning av Git). Detta innebÃ¤r att du kan se vem som faktiskt Ã¶versatte varje strÃ¤ng genom att undersÃ¶ka fÃ¤ltet fÃ¶r commit-fÃ¶rfattare. Detsamma gÃ¤ller Mercurial; endast Subversion har inte denna funktion.

source: In Git, there is a distinction between the committer (who created the commit object) and the author (who made the changes). Weblate acts as the committer while preserving individual translator attribution as authors.
sv: I Git skiljer man mellan committer (den som skapade commit-objektet) och fÃ¶rfattaren (den som gjorde Ã¤ndringarna). Weblate fungerar som committer samtidigt som man bevarar enskilda Ã¶versÃ¤ttares upphovsrÃ¤tt som fÃ¶rfattare.

source: For commits where authorship cannot be determined (such as automated changes from anonymous suggestions or machine translation results), the author is set to the anonymous user. You can configure the anonymous user's name and e-mail in :setting:`ANONYMOUS_USER_NAME`.
sv: FÃ¶r commit dÃ¤r upphovsmannen inte kan faststÃ¤llas (t.ex. automatiska Ã¤ndringar frÃ¥n anonyma fÃ¶rslag eller maskinÃ¶versÃ¤ttningsresultat) anges upphovsmannen som anonym anvÃ¤ndare. Du kan konfigurera den anonyma anvÃ¤ndarens namn och e-postadress i :setting:`ANONYMOUS_USER_NAME`.

source: How to move files in the repository without losing history in Weblate?
sv: Hur flyttar man filer i arkivet utan att fÃ¶rlora historiken i Weblate?

source: To keep the history, comments, or screenshots linked to strings after changing the files location you need to ensure that these strings are never deleted in Weblate. These removals can happen in case the Weblate repository is updated, but the component configuration still points to the old files. This makes Weblate assume that it should delete all the translations.
sv: FÃ¶r att behÃ¥lla historiken, kommentarerna eller skÃ¤rmdumparna kopplade till strÃ¤ngarna efter att du har Ã¤ndrat filernas plats mÃ¥ste du se till att dessa strÃ¤ngar aldrig raderas i Weblate. Dessa borttagningar kan intrÃ¤ffa om Weblate-arkivet uppdateras, men komponentkonfigurationen fortfarande pekar pÃ¥ de gamla filerna. Detta gÃ¶r att Weblate antar att alla Ã¶versÃ¤ttningar ska raderas.

source: The solution to this is to perform the operation in sync with Weblate:
sv: LÃ¶sningen pÃ¥ detta Ã¤r att utfÃ¶ra operationen synkroniserat med Weblate:

source: Lock the affected component in Weblate.
sv: LÃ¥s den berÃ¶rda komponenten i Weblate.

source: Commit any pending changes and merge them into the upstream repository.
sv: BekrÃ¤fta alla vÃ¤ntande Ã¤ndringar och slÃ¥ ihop dem i uppstrÃ¶msrepositoriet.

source: Disable receiving webhooks the :ref:`project`; this prevents Weblate from immediately seeing changes in the repository.
sv: Inaktivera mottagning av webhooks fÃ¶r :ref:`project`; detta fÃ¶rhindrar Weblate frÃ¥n att omedelbart se Ã¤ndringar i arkivet.

source: Do any needed changes in the repo (for example using :command:`git mv`), push them to the upstream repository.
sv: GÃ¶r eventuella nÃ¶dvÃ¤ndiga Ã¤ndringar i repo (till exempel med hjÃ¤lp av :command:`git mv`), och skicka dem till uppstrÃ¶msrepositoriet.

source: Change the :ref:`component` to match the new setup; upon changing configuration, Weblate will fetch the updated repository and notice the changed locations while keeping existing strings.
sv: Ãndra :ref:`component` sÃ¥ att den matchar den nya konfigurationen. NÃ¤r konfigurationen Ã¤ndras hÃ¤mtar Weblate det uppdaterade arkivet och noterar de Ã¤ndrade platserna samtidigt som befintliga strÃ¤ngar behÃ¥lls.

source: Unlock the component and re-enable hooks in the project configuration.
sv: LÃ¥s upp komponenten och Ã¥teraktivera krokarna i projektkonfigurationen.

source: :ref:`projectbackup` might be useful to perform prior to such disrupting changes.
sv: :ref:`projectbackup` kan vara anvÃ¤ndbart att utfÃ¶ra innan sÃ¥dana stÃ¶rande fÃ¶rÃ¤ndringar.

source: How do I review the translations of others?
sv: Hur granskar jag andras Ã¶versÃ¤ttningar?

source: There are several review based workflows available in Weblate, see :ref:`workflows`.
sv: Det finns flera granskningsbaserade arbetsflÃ¶den tillgÃ¤ngliga i Weblate, se :ref:`workflows`.

source: You can subscribe to any changes made in :ref:`notifications` and then check others contributions as they come in by e-mail.
sv: Du kan prenumerera pÃ¥ alla Ã¤ndringar som gÃ¶rs i :ref:`notifications` och sedan kontrollera andras bidrag nÃ¤r de kommer in via e-post.

source: There is a review tool available at the bottom of the translation view, where you can choose to browse translations made by others since a given date.
sv: I botten av Ã¶versÃ¤ttningsvyn finns ett granskningsverktyg dÃ¤r du kan vÃ¤lja att blÃ¤ddra bland Ã¶versÃ¤ttningar som gjorts av andra sedan ett visst datum.

source: How do I provide feedback on a source string?
sv: Hur ger jag feedback pÃ¥ en kÃ¤llstrÃ¤ng?

source: On context tabs below translation, you can use the :guilabel:`Comments` tab to provide feedback on a source string, or discuss it with other translators.
sv: PÃ¥ kontextflikarna under Ã¶versÃ¤ttningen kan du anvÃ¤nda fliken :guilabel:`Kommentarer` fÃ¶r att ge feedback pÃ¥ en kÃ¤llstrÃ¤ng eller diskutera den med andra Ã¶versÃ¤ttare.

source: How can I use existing translations while translating?
sv: Hur kan jag anvÃ¤nda befintliga Ã¶versÃ¤ttningar nÃ¤r jag Ã¶versÃ¤tter?

source: All translations within Weblate can be used thanks to shared translation memory.
sv: Alla Ã¶versÃ¤ttningar inom Weblate kan anvÃ¤ndas tack vare delat Ã¶versÃ¤ttningsminne.

source: You can import existing translation memory files into Weblate.
sv: Du kan importera befintliga Ã¶versÃ¤ttningsminnesfiler till Weblate.

source: Use the import functionality to load compendium as translations, suggestions or translations needing review. This is the best approach for a one-time translation using a compendium or a similar translation database.
sv: AnvÃ¤nd importfunktionen fÃ¶r att ladda kompendiet som Ã¶versÃ¤ttningar, fÃ¶rslag eller Ã¶versÃ¤ttningar som behÃ¶ver granskas. Detta Ã¤r den bÃ¤sta metoden fÃ¶r en engÃ¥ngsÃ¶versÃ¤ttning med hjÃ¤lp av ett kompendium eller en liknande Ã¶versÃ¤ttningsdatabas.

source: You can set up :ref:`mt-tmserver` with all databases you have and let Weblate use it. This is good when you want to use it several times during translation.
sv: Du kan konfigurera :ref:`mt-tmserver` med alla databaser du har och lÃ¥ta Weblate anvÃ¤nda den. Detta Ã¤r bra nÃ¤r du vill anvÃ¤nda den flera gÃ¥nger under Ã¶versÃ¤ttningen.

source: Another option is to translate all related projects in a single Weblate instance, which will make it automatically pick up translations from other projects as well.
sv: Ett annat alternativ Ã¤r att Ã¶versÃ¤tta alla relaterade projekt i en enda Weblate-instans, vilket gÃ¶r att den automatiskt hÃ¤mtar Ã¶versÃ¤ttningar frÃ¥n andra projekt ocksÃ¥.

source: Does Weblate update translation files besides translations?
sv: Uppdaterar Weblate Ã¶versÃ¤ttningsfiler fÃ¶rutom Ã¶versÃ¤ttningar?

source: Weblate tries to limit changes in translation files to a minimum. For some file formats it might unfortunately lead to reformatting the file. If you want to keep the file formatted your way, please use a pre-commit hook for that.
sv: Weblate fÃ¶rsÃ¶ker begrÃ¤nsa Ã¤ndringar i Ã¶versÃ¤ttningsfiler till ett minimum. FÃ¶r vissa filformat kan detta tyvÃ¤rr leda till att filen omformateras. Om du vill behÃ¥lla filens format, anvÃ¤nd en pre-commit-hook fÃ¶r detta.

source: How do I merge updated POT file with PO translations?
sv: Hur sammanfogar jag uppdaterade POT-filer med PO-Ã¶versÃ¤ttningar?

source: See :ref:`updating-target-files` for information on updating PO files when the POT template changes.
sv: Se :ref:`updating-target-files` fÃ¶r information om hur du uppdaterar PO-filer nÃ¤r POT-mallen Ã¤ndras.

source: Where do language definitions come from and how can I add my own?
sv: VarifrÃ¥n kommer sprÃ¥kteckningarna och hur kan jag lÃ¤gga till egna?

source: The basic set of language definitions is included within Weblate and Translate-toolkit. This covers more than 150 languages and includes info about plural forms or text direction.
sv: Den grundlÃ¤ggande uppsÃ¤ttningen sprÃ¥kteckningar ingÃ¥r i Weblate och Translate-toolkit. Den tÃ¤cker mer Ã¤n 150 sprÃ¥k och innehÃ¥ller information om pluralformer och textriktning.

source: You are free to define your own languages in the administrative interface, you just need to provide info about it.
sv: Du kan fritt definiera dina egna sprÃ¥k i administrationsgrÃ¤nssnittet, du behÃ¶ver bara ange information om det.

source: Can Weblate highlight changes in a fuzzy string?
sv: Kan Weblate markera Ã¤ndringar i en fuzzy-strÃ¤ng?

source: Weblate supports this, however it needs the data to show the difference.
sv: Weblate stÃ¶der detta, men det behÃ¶ver data fÃ¶r att visa skillnaden.

source: For Gettext PO files, you have to pass the parameter ``--previous`` to :command:`msgmerge` when updating PO files, for example:
sv: FÃ¶r Gettext PO-filer mÃ¥ste du ange parametern ``--previous`` till :command:`msgmerge` nÃ¤r du uppdaterar PO-filer, till exempel:

source: For monolingual translations, Weblate can find the previous string by ID, so it shows the differences automatically.
sv: FÃ¶r ensprÃ¥kiga Ã¶versÃ¤ttningar kan Weblate hitta den tidigare strÃ¤ngen med hjÃ¤lp av ID, sÃ¥ att skillnaderna visas automatiskt.

source: Why does Weblate still show old translation strings when I've updated the template?
sv: VarfÃ¶r visar Weblate fortfarande gamla Ã¶versÃ¤ttningsstrÃ¤ngar nÃ¤r jag har uppdaterat mallen?

source: Weblate does not try to manipulate the translation files in any way other than allowing translators to translate. So it also does not update the translatable files when the template or source code have been changed. You simply have to do this manually and push changes to the repository, Weblate will then pick up the changes automatically.
sv: Weblate fÃ¶rsÃ¶ker inte manipulera Ã¶versÃ¤ttningsfilerna pÃ¥ nÃ¥got annat sÃ¤tt Ã¤n att lÃ¥ta Ã¶versÃ¤ttarna Ã¶versÃ¤tta. Det uppdaterar alltsÃ¥ inte de Ã¶versÃ¤ttningsbara filerna nÃ¤r mallen eller kÃ¤llkoden har Ã¤ndrats. Du mÃ¥ste helt enkelt gÃ¶ra detta manuellt och skicka Ã¤ndringarna till arkivet, sÃ¥ hÃ¤mtar Weblate Ã¤ndringarna automatiskt.

source: It is usually a good idea to merge changes done in Weblate before updating translation files, as otherwise you will usually end up with some conflicts to merge.
sv: Det Ã¤r vanligtvis en bra idÃ© att slÃ¥ samman Ã¤ndringar som gjorts i Weblate innan du uppdaterar Ã¶versÃ¤ttningsfilerna, eftersom du annars oftast kommer att fÃ¥ konflikter att lÃ¶sa.

source: How to handle renaming translation files?
sv: Hur hanterar man omdÃ¶pning av Ã¶versÃ¤ttningsfiler?

source: When renaming files in the repository, it can happen that Weblate sees this as removal and adding of the files. This can lead to losing strings history, comments and suggestions.
sv: NÃ¤r du byter namn pÃ¥ filer i arkivet kan det hÃ¤nda att Weblate tolkar detta som att filerna tas bort och lÃ¤ggs till. Detta kan leda till att strÃ¤nghistorik, kommentarer och fÃ¶rslag gÃ¥r fÃ¶rlorade.

source: To avoid that, perform renaming in following steps:
sv: FÃ¶r att undvika detta, utfÃ¶r namnÃ¤ndringen enligt fÃ¶ljande steg:

source: Lock the translation component in :ref:`manage-vcs`.
sv: LÃ¥s Ã¶versÃ¤ttningskomponenten i :ref:`manage-vcs`.

source: Commit pending changes in :ref:`manage-vcs`.
sv: BekrÃ¤fta vÃ¤ntande Ã¤ndringar i :ref:`manage-vcs`.

source: Merge Weblate changes to the upstream repository.
sv: Sammanfoga Weblate-Ã¤ndringar till uppstrÃ¶msrepositoriet.

source: Disable receiving updates via hooks using :ref:`project-enable_hooks`.
sv: Inaktivera mottagning av uppdateringar via hooks med hjÃ¤lp av :ref:`project-enable_hooks`.

source: Perform the renaming of the files in the repository.
sv: UtfÃ¶r omdÃ¶pningen av filerna i arkivet.

source: Update the component configuration to match new file names.
sv: Uppdatera komponentkonfigurationen sÃ¥ att den stÃ¤mmer Ã¶verens med de nya filnamnen.

source: Enable update hooks and unlock the component.
sv: Aktivera uppdateringshookar och lÃ¥s upp komponenten.

source: Requests sometimes fail with "too many open files" error
sv: BegÃ¤ran misslyckas ibland med felmeddelandet "fÃ¶r mÃ¥nga Ã¶ppna filer"

source: This happens sometimes when your Git repository grows too much and you have many of them. Compressing the Git repositories will improve this situation.
sv: Detta hÃ¤nder ibland nÃ¤r ditt Git-arkiv vÃ¤xer sig fÃ¶r stort och du har mÃ¥nga av dem. Komprimering av Git-arkiven fÃ¶rbÃ¤ttrar denna situation.

source: The easiest way to do this is to run:
sv: Det enklaste sÃ¤ttet att gÃ¶ra detta Ã¤r att kÃ¶ra:

source: When accessing the site I get a "Bad Request (400)" error
sv: NÃ¤r jag fÃ¶rsÃ¶ker komma Ã¥t webbplatsen fÃ¥r jag felmeddelandet "Bad Request (400)"

source: This is most likely caused by an improperly configured :setting:`ALLOWED_HOSTS`. It needs to contain all hostnames you want to access on your Weblate. For example:
sv: Detta beror troligen pÃ¥ en felaktigt konfigurerad :setting:`ALLOWED_HOSTS`. Den mÃ¥ste innehÃ¥lla alla vÃ¤rdnamn som du vill ha Ã¥tkomst till pÃ¥ din Weblate. Till exempel:

source: What does mean "There are more files for the single language (en)"?
sv: Vad betyder "Det finns fler filer fÃ¶r det enskilda sprÃ¥ket (en)"?

source: This typically happens when you have translation file for source language. Weblate keeps track of source strings and reserves source language for this. The additional file for same language is not processed.
sv: Detta hÃ¤nder vanligtvis nÃ¤r du har en Ã¶versÃ¤ttningsfil fÃ¶r kÃ¤llsprÃ¥ket. Weblate hÃ¥ller reda pÃ¥ kÃ¤llstrÃ¤ngar och reserverar kÃ¤llsprÃ¥ket fÃ¶r detta. Den extra filen fÃ¶r samma sprÃ¥k behandlas inte.

source: In case the translation to the source language is desired, please change the :ref:`component-source_language` in the component settings. You might want to use `English (Developer)` as a source language, or utilize :ref:`source-quality-gateway`.
sv: Om du vill ha Ã¶versÃ¤ttningen till kÃ¤llsprÃ¥ket, Ã¤ndra :ref:`component-source_language` i komponentinstÃ¤llningarna. Du kan anvÃ¤nda `English (Developer)` som kÃ¤llsprÃ¥k eller anvÃ¤nda :ref:`source-quality-gateway`.

source: In case the translation file for the source language is not needed, please remove it from the repository.
sv: Om Ã¶versÃ¤ttningsfilen fÃ¶r kÃ¤llsprÃ¥ket inte behÃ¶vs, ta bort den frÃ¥n arkivet.

source: In case the translation file for the source language is needed, but should be ignored by Weblate, please adjust the :ref:`component-language_regex` to exclude it.
sv: Om Ã¶versÃ¤ttningsfilen fÃ¶r kÃ¤llsprÃ¥ket behÃ¶vs, men ska ignoreras av Weblate, justera :ref:`component-language_regex` fÃ¶r att utesluta den.

source: You might get similar error message for other languages as well. In that case the most likely reason is that several files map to single language in Weblate.
sv: Du kan fÃ¥ liknande felmeddelanden Ã¤ven fÃ¶r andra sprÃ¥k. I sÃ¥ fall Ã¤r den mest troliga orsaken att flera filer Ã¤r kopplade till ett enda sprÃ¥k i Weblate.

source: This can be caused by using obsolete language codes together with new one (``ja`` and ``jp`` for Japanese) or including both country specific and generic codes (``fr`` and ``fr_FR``). See :ref:`language-parsing-codes` for more details.
sv: Detta kan orsakas av att man anvÃ¤nder fÃ¶rÃ¥ldrade sprÃ¥kkoder tillsammans med nya (``ja`` och ``jp`` fÃ¶r japanska) eller inkluderar bÃ¥de landsspecifika och generiska koder (``fr`` och ``fr_FR``). Se :ref:`language-parsing-codes` fÃ¶r mer information.

source: Does Weblate support other VCSes than Git and Mercurial?
sv: StÃ¶der Weblate andra VCS-system Ã¤n Git och Mercurial?

source: Weblate currently does not have native support for anything other than :ref:`vcs-git` (with extended support for :ref:`vcs-github`, :ref:`vcs-gerrit` and :ref:`vcs-git-svn`) and :ref:`vcs-mercurial`, but it is possible to write backends for other VCSes.
sv: Weblate har fÃ¶r nÃ¤rvarande inte inbyggt stÃ¶d fÃ¶r nÃ¥got annat Ã¤n :ref:`vcs-git` (med utÃ¶kat stÃ¶d fÃ¶r :ref:`vcs-github`, :ref:`vcs-gerrit` och :ref:`vcs-git-svn`) och :ref:`vcs-mercurial`, men det Ã¤r mÃ¶jligt att skriva backends fÃ¶r andra VCS:er.

source: Weblate also supports VCS-less operation, see :ref:`vcs-local`.
sv: Weblate stÃ¶der Ã¤ven drift utan VCS, se :ref:`vcs-local`.

source: For native support of other VCSes, Weblate requires using distributed VCS, and could probably be adjusted to work with anything other than Git and Mercurial, but somebody has to implement this support.
sv: FÃ¶r inbyggt stÃ¶d fÃ¶r andra VCS-system krÃ¤ver Weblate anvÃ¤ndning av distribuerade VCS-system, och kan fÃ¶rmodligen anpassas fÃ¶r att fungera med andra system Ã¤n Git och Mercurial, men nÃ¥gon mÃ¥ste implementera detta stÃ¶d.

source: How does Weblate credit translators?
sv: Hur krediterar Weblate Ã¶versÃ¤ttare?

source: Every change made in Weblate is committed into VCS under the translators name. This way every single change has proper authorship, and you can track it down using the standard VCS tools you use for code.
sv: Varje Ã¤ndring som gÃ¶rs i Weblate registreras i VCS under Ã¶versÃ¤ttarens namn. PÃ¥ sÃ¥ sÃ¤tt har varje enskild Ã¤ndring rÃ¤tt upphovsman, och du kan spÃ¥ra den med hjÃ¤lp av de vanliga VCS-verktyg som du anvÃ¤nder fÃ¶r kod.

source: Additionally, when the translation file format supports it, the file headers are updated to include the translator's name.
sv: Dessutom, nÃ¤r Ã¶versÃ¤ttningsfilformatet stÃ¶der det, uppdateras filrubrikerna sÃ¥ att de inkluderar Ã¶versÃ¤ttarens namn.

source: Why does Weblate force showing all PO files in a single tree?
sv: VarfÃ¶r tvingar Weblate fram visning av alla PO-filer i ett enda trÃ¤d?

source: Weblate was designed in a way that every PO file is represented as a single component. This is beneficial for translators, so they know what they are actually translating.
sv: Weblate har utformats sÃ¥ att varje PO-fil representeras som en enskild komponent. Detta Ã¤r fÃ¶rdelaktigt fÃ¶r Ã¶versÃ¤ttare, eftersom de dÃ¥ vet vad de faktiskt Ã¶versÃ¤tter.

source: Translators can translate all the components of a project into a specific language as a whole.
sv: ÃversÃ¤ttare kan Ã¶versÃ¤tta alla delar av ett projekt till ett specifikt sprÃ¥k som en helhet.

source: Why does Weblate use language codes such sr_Latn or zh_Hant?
sv: VarfÃ¶r anvÃ¤nder Weblate sprÃ¥kkoder som sr_Latn eller zh_Hant?

source: These are language codes defined by :rfc:`5646` to better indicate that they are really different languages instead previously wrongly used modifiers (for ``@latin`` variants) or country codes (for Chinese).
sv: Dessa Ã¤r sprÃ¥kkoder som definieras av :rfc:`5646` fÃ¶r att bÃ¤ttre ange att det verkligen Ã¤r olika sprÃ¥k istÃ¤llet fÃ¶r tidigare felaktigt anvÃ¤nda modifierare (fÃ¶r ``@latin``-varianter) eller landskoder (fÃ¶r kinesiska).

source: Weblate still understands legacy language codes and will map them to current one - for example ``sr@latin`` will be handled as ``sr_Latn`` or ``zh@CN`` as ``zh_Hans``.
sv: Weblate fÃ¶rstÃ¥r fortfarande Ã¤ldre sprÃ¥kkoder och kommer att mappa dem till aktuella koder â till exempel kommer ``sr@latin`` att hanteras som ``sr_Latn`` och ``zh@CN`` som ``zh_Hans``.

source: Weblate defaults to POSIX style language codes with underscore, see :ref:`languages` for more details.
sv: Weblate anvÃ¤nder som standard sprÃ¥kkoder i POSIX-stil med understreck, se :ref:`languages` fÃ¶r mer information.

source: Localization file formats
sv: Lokalisering filformat

source: Weblate supports a wide range of translation formats. Each format is slightly different and provides a different set of capabilities.
sv: Weblate stÃ¶der ett brett utbud av Ã¶versÃ¤ttningsformat. Varje format Ã¤r nÃ¥got olika och erbjuder olika funktioner.
